# Pandas Series

A Series is one-dimentional labeled array capable of handling any data type. The axis labels are collectively called the index.

### Creating Series

There are multiple ways to create pandas series.

In [2]:
import  numpy as np 
import pandas as pd

In [73]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,10:30}

In [74]:
pd.Series(data = mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [75]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [76]:
pd.Series(d)
# key will be the index by default

1     10
2     20
10    30
dtype: int64

### ðŸ”¹ What is a DataFrame?

A DataFrame is a 2D labeled data structure in pandas.
Think of it like an Excel sheet or SQL table:

Rows â†’ observations/records

Columns â†’ fields/features

Itâ€™s built on top of NumPy arrays but with more flexibility.

In [77]:
# from  dictionary 

data = {
    "Name": ["Anurag", "Ravi", "Sneha"],
    "Age": [25, 30, 28],
    "Department": ["IT", "HR", "Finance"]
}

df = pd.DataFrame(data)
print('\nfrom dictionary\n',df)


# from lists

data = [
    [1, 'Laptop', 60000],
    [2, 'Mobile', 30000],
    [3, 'Tablet', 20000]
]

df = pd.DataFrame(data)
print('\nfrom lists without column header \n',df)
df = pd.DataFrame(data,columns=['ID','Product','Price'])
print('\nfrom lists\n',df)

from dictionary
      Name  Age Department
0  Anurag   25         IT
1    Ravi   30         HR
2   Sneha   28    Finance

from lists without column header
    0       1      2
0  1  Laptop  60000
1  2  Mobile  30000
2  3  Tablet  20000

from lists
    ID Product  Price
0   1  Laptop  60000
1   2  Mobile  30000
2   3  Tablet  20000

In [78]:
# df = pd.read_csv("data.csv")
# print(df.head())  # first 5 rows

Selecting and Indexing of Columns

In [90]:
print('Select a single column\n')
df['Product']

Select a single column

0    Laptop
1    Mobile
2    Tablet
Name: Product, dtype: object

In [91]:
print('Select multiple columns')
df[['Product','Price']]

Select multiple columns

  Product  Price
0  Laptop  60000
1  Mobile  30000
2  Tablet  20000

### Indexing Rows & Columns

Using iloc â†’ index-based selection

In [ ]:
print('first row\n',df.iloc[0])     
print('\nfirst row 3rd column\n',df.iloc[1, 3]) 
print('\nall rows, second column\n',df.iloc[:, 1])
print('\nall rows, second  and 3rd column\n',df.iloc[:, 1:3])

first row
 ID               1
Product     Laptop
Price        60000
Discount         5
Name: 0, dtype: object

first row 3rd column
 10

all rows, second column
 0    Laptop
1    Mobile
2    Tablet
Name: Product, dtype: object

all rows, second  and 3rd column
   Product  Price
0  Laptop  60000
1  Mobile  30000
2  Tablet  20000

Using loc â†’ label-based selection

In [76]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [24, 30, 35, 40],
    "City": ["New York", "London", "Paris", "Tokyo"]
}

df1 = pd.DataFrame(data, index=["a", "b", "c", "d"])

# Using label index
print('\n',df1.loc["a"])      # Row with index label "a"
print('\n',df1.loc[["a", "c"]])  # Multiple rows

 Name       Alice
Age           24
City    New York
Name: a, dtype: object

       Name  Age      City
a    Alice   24  New York
c  Charlie   35     Paris

Selecting Subset

In [77]:
print(df.loc[['a','b']][['Name','City']],'\n')
#OR
print(df.loc[['a','b'],['Name','City']],'\n')

print(df.loc[['c','d'],['City','Age']],'\n')

    Name      City
a  Alice  New York
b    Bob    London

    Name      City
a  Alice  New York
b    Bob    London

    City  Age
c  Paris   35
d  Tokyo   40

Conditional Selection

In [79]:
# Select rows where Age > 30
print(df.loc[df1["Age"] > 30])

print('\n',df.loc[(df['Age']<30) & (df['City']=='New York')])

# Select names where City == "London"
print('\n',df1.loc[df1["City"] == "London", ["Name",'Age']])

      Name  Age   City
c  Charlie   35  Paris
d    David   40  Tokyo

     Name  Age      City
a  Alice   24  New York

   Name  Age
b  Bob   30

Slicing

In [61]:
# Row slicing (by labels)
print(df1.loc["a":"b"])   # includes "c"

# Row slicing (by index positions)
print(df1.iloc[0:3])

    Name  Age      City
a  Alice   24  New York
b    Bob   30    London
      Name  Age      City
a    Alice   24  New York
b      Bob   30    London
c  Charlie   35     Paris

creating new column

In [62]:
df1['Discount'] = [5,10,15,45]
df1

      Name  Age      City  Discount
a    Alice   24  New York         5
b      Bob   30    London        10
c  Charlie   35     Paris        15
d    David   40     Tokyo        45

Removing column

In [63]:
# Removing single column
print('\n',df1.drop('City', axis=1))  # axis=1 means column

# Removing Multiple Columns
print('\n',df1.drop(['Age','Discount'], axis=1))

       Name  Age  Discount
a    Alice   24         5
b      Bob   30        10
c  Charlie   35        15
d    David   40        45

       Name      City
a    Alice  New York
b      Bob    London
c  Charlie     Paris
d    David     Tokyo

In [ ]:
print('\n These drop  change the original dataframe',df1.drop('Age',axis=1,inplace = True))# drop() returns None (because it doesnâ€™t need to return anything â€” the original df1 is already changed).

 These drop  change the original dataframe None

In [65]:
df1

      Name      City  Discount
a    Alice  New York         5
b      Bob    London        10
c  Charlie     Paris        15
d    David     Tokyo        45